#+TITLE: notes
#+SETUPFILE: ox.setup
#+CATEGORY: notes
#+STARTUP: overview
***** Exploring Rocks
:PROPERTIES:
:ID:       2a1a1b60-f927-4de6-b90a-69bf03edb62d
:CUSTOM_ID: exploring-rocks
:END:
  first step is to clone the repo and take a peak at the examples.

  - clone repo & compile static_lib

  #+begin_src sh :exports code
git clone https://github.com/facebook/rocksdb && cd rocksdb
make static_lib
cd examples/; make all
  #+end_src

  the examples don't output anything to stdout when they're run, but many of them store database files under a directory in =/tmp= which can be inspected. after compiling the library in the root you get a =make_config.mk= which is include'd in =examples/makefile=. worth checking out to get a better understanding of how examples are compiled (with g++).

  let's take a look at the output of options_file_example:

  #+begin_src sh :exports both :eval never-export
cd ./media/01/rocksdb_options_file_example && ls
  #+end_src

  #+results:
  | 000012.log               |
  | CURRENT                  |
  | IDENTITY                 |
  | LOCK                     |
  | LOG                      |
  | LOG.old.1621383828949925 |
  | MANIFEST-000011          |
  | OPTIONS-000009           |
  | OPTIONS-000014           |

  The LOG file looks like this:
  #+begin_example
 7f1c37455ac0 RocksDB version: 6.20.0
 7f1c37455ac0 Git sha a0e0feca6281e6f3c207757a15f6b99d3a67070d
 7f1c37455ac0 Compile date 2021-04-28 12:52:53
 7f1c37455ac0 DB SUMMARY
 7f1c37455ac0 DB Session ID:  73HSPOGLJMAK0WD2FX8D
 7f1c37455ac0 CURRENT file:  CURRENT
 7f1c37455ac0 IDENTITY file:  IDENTITY
 7f1c37455ac0 MANIFEST file:  MANIFEST-000004 size: 110 Bytes
 7f1c37455ac0 SST files in /tmp/rocksdb_options_file_example dir, Total Num: 0, files: 
# ...
  #+end_example

  and the OPTIONS file like this:
  #+begin_example
[Version]
  rocksdb_version=6.20.0
  options_file_version=1.1

[DBOptions]
# ...
  #+end_example

  DB [[https://github.com/facebook/rocksdb/wiki/RocksDB-Options-File][Option Files]] are stored in [[https://en.wikipedia.org/wiki/INI_file][INI]] format. There are a looooot of
  options and a lot of information shown in the LOG. Yikes!
	
*** Rust                                                               :rs:
:PROPERTIES:
:ID: b46de918-896e-420d-8cde-09c21ae93ecd
:CUSTOM_ID: rust
:END:
A multi-paradign systems programming language, and a personal
favorite of mine.
- [[https://doc.rust-lang.org/book/][The Rust Book]]
- [[https://doc.rust-lang.org/rust-by-example/][Rust By Example]]
- [[https://doc.rust-lang.org/rustc][the rustc book]]
  :notes:
  - rustc is the Rust compiler. It is rarely invoked directly by the
    programmer, but rather indirectly through Cargo. Use the
    =--verbose= flag to see how =rustc= is called, for example in:
    #+begin_src shell
    cargo build --verbose
    #+end_src
    
  - The compiler has many options.
    #+begin_src shell :exports both :results output replace
rustc --help    
    #+end_src
    #+RESULTS:
    #+begin_example
    Usage: rustc [OPTIONS] INPUT

    Options:
        -h, --help          Display this message
            --cfg SPEC      Configure the compilation environment
        -L [KIND=]PATH      Add a directory to the library search path. The
                            optional KIND can be one of dependency, crate, native,
                            framework, or all (the default).
        -l [KIND[:MODIFIERS]=]NAME[:RENAME]
                            Link the generated crate(s) to the specified native
                            library NAME. The optional KIND can be one of
                            static, framework, or dylib (the default).
                            Optional comma separated MODIFIERS
                            (bundle|verbatim|whole-archive|as-needed)
                            may be specified each with a prefix of either '+' to
                            enable or '-' to disable.
            --crate-type [bin|lib|rlib|dylib|cdylib|staticlib|proc-macro]
                            Comma separated list of types of crates
                            for the compiler to emit
            --crate-name NAME
                            Specify the name of the crate being built
            --edition 2015|2018|2021
                            Specify which edition of the compiler to use when
                            compiling code.
            --emit [asm|llvm-bc|llvm-ir|obj|metadata|link|dep-info|mir]
                            Comma separated list of types of output for the
                            compiler to emit
            --print [crate-name|file-names|sysroot|target-libdir|cfg|target-list|target-cpus|target-features|relocation-models|code-models|tls-models|target-spec-json|native-static-libs]
                            Compiler information to print on stdout
        -g                  Equivalent to -C debuginfo=2
        -O                  Equivalent to -C opt-level=2
        -o FILENAME         Write output to <filename>
            --out-dir DIR   Write output to compiler-chosen filename in <dir>
            --explain OPT   Provide a detailed explanation of an error message
            --test          Build a test harness
            --target TARGET Target triple for which the code is compiled
        -A, --allow LINT    Set lint allowed
        -W, --warn LINT     Set lint warnings
            --force-warn LINT
                            Set lint force-warn
        -D, --deny LINT     Set lint denied
        -F, --forbid LINT   Set lint forbidden
            --cap-lints LEVEL
                            Set the most restrictive lint level. More restrictive
                            lints are capped at this level
        -C, --codegen OPT[=VALUE]
                            Set a codegen option
        -V, --version       Print version info and exit
        -v, --verbose       Use verbose output

    Additional help:
        -C help             Print codegen options
        -W help             Print 'lint' options and default settings
        -Z help             Print unstable compiler options
        --help -v           Print the full set of options rustc accepts

    #+end_example
  :end:
- [[https://doc.rust-lang.org/cargo][The Cargo Book]]
